&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент) //программируем реакцию системы на события, связанные с полем формы (ПКМ на Количество) 

	СтрокаТЧ = Элементы.ПереченьТоваров.ТекущиеДанные; //получаем строку фокуса пользователя
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена; //пересчитываем сумму

КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент) //---/--- (ПКМ на Цена)

	СтрокаТЧ = Элементы.ПереченьТоваров.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ЗаписываемыйДокумент, ПараметрыЗаписи) //создаем реакцию на общие события формы (ПКМ на Форма) 

	Сообщить("Всего в документе " + ЗаписываемыйДокумент.ПереченьТоваров.Количество()
		+ " строк, с количеством товаров " + ЗаписываемыйДокумент.ПереченьТоваров.Итог("Количество") + " шт");

КонецПроцедуры