
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ЗаписываемыйДокумент, ПараметрыЗаписи)
	
	Сообщить("Всего в документе " + 
	ЗаписываемыйДокумент.ПереченьТоваров.Количество() + " строк, с количеством товаров " + 
	ЗаписываемыйДокумент.ПереченьТоваров.Итог("Количество") + " шт");

КонецПроцедуры
&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент) //программируем реакцию системы на события, связанные с полем формы  
	
	СтрокаТЧ = Элементы.ПереченьТоваров.ТекущиеДанные; //получаем строку фокуса пользователя
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена; //пересчитываем сумму
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ПереченьТоваров.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	
КонецПроцедуры

