&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент) //программируем реакцию системы на события, связанные с полем формы  

	СтрокаТЧ = Элементы.ПереченьТоваров.ТекущиеДанные; //получаем строку фокуса пользователя
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена; //пересчитываем сумму

КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)

	СтрокаТЧ = Элементы.ПереченьТоваров.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ЗаписываемыйДокумент, ПараметрыЗаписи)

	Сообщить("Общая сумма по документу " + ЗаписываемыйДокумент.ПереченьТоваров.Итог("Сумма") + " руб");

КонецПроцедуры